word = input()
index_list = []
for index in range(len(word)):
    if word[index].isupper():
        index_list.append(index)

print(index_list)

'''
какво се случва тук:
казваме , за всеки индекс в рейндж дължината на думата( да не се забравя,че индексите в 1 стринг винаги започват от 0)
при първата итерация индекса е 0. и питаме.
Ако индекс 0 от думата е главен , добави този индекс във индекс лист-а.
да се обърбе внимание,че index_list = не е просто стринг , който тъпчем а data type - list


'''